GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_intmux.h
/**
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_intmux.h
  * @author  FMSH Application Team
  * @brief   Head file of INTMUX FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FH0XX_FL_INTMUX_H
#define __FM33FH0XX_FL_INTMUX_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fh0xx_fl_def.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CMU_FL_ES_INIT INTMUX Exported Init structures
  * @{
  */


/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup INTMUX_FL_Exported_Constants INTMUX Exported Constants
  * @{
  */


#define    INTMUX_CR2_MUX31SEL_Pos                                 (30U)
#define    INTMUX_CR2_MUX31SEL_Msk                                 (0x3U << INTMUX_CR2_MUX31SEL_Pos)
#define    INTMUX_CR2_MUX31SEL                                     INTMUX_CR2_MUX31SEL_Msk

#define    INTMUX_CR2_MUX30SEL_Pos                                 (28U)
#define    INTMUX_CR2_MUX30SEL_Msk                                 (0x3U << INTMUX_CR2_MUX30SEL_Pos)
#define    INTMUX_CR2_MUX30SEL                                     INTMUX_CR2_MUX30SEL_Msk

#define    INTMUX_CR2_MUX29SEL_Pos                                 (26U)
#define    INTMUX_CR2_MUX29SEL_Msk                                 (0x3U << INTMUX_CR2_MUX29SEL_Pos)
#define    INTMUX_CR2_MUX29SEL                                     INTMUX_CR2_MUX29SEL_Msk

#define    INTMUX_CR2_MUX28SEL_Pos                                 (24U)
#define    INTMUX_CR2_MUX28SEL_Msk                                 (0x3U << INTMUX_CR2_MUX28SEL_Pos)
#define    INTMUX_CR2_MUX28SEL                                     INTMUX_CR2_MUX28SEL_Msk

#define    INTMUX_CR2_MUX27SEL_Pos                                 (22U)
#define    INTMUX_CR2_MUX27SEL_Msk                                 (0x3U << INTMUX_CR2_MUX27SEL_Pos)
#define    INTMUX_CR2_MUX27SEL                                     INTMUX_CR2_MUX27SEL_Msk

#define    INTMUX_CR2_MUX26SEL_Pos                                 (20U)
#define    INTMUX_CR2_MUX26SEL_Msk                                 (0x3U << INTMUX_CR2_MUX26SEL_Pos)
#define    INTMUX_CR2_MUX26SEL                                     INTMUX_CR2_MUX26SEL_Msk

#define    INTMUX_CR2_MUX25SEL_Pos                                  (18U)
#define    INTMUX_CR2_MUX25SEL_Msk                                  (0x3U << INTMUX_CR2_MUX25SEL_Pos)
#define    INTMUX_CR2_MUX25SEL                                      INTMUX_CR2_MUX25SEL_Msk

#define    INTMUX_CR2_MUX24SEL_Pos                                  (16U)
#define    INTMUX_CR2_MUX24SEL_Msk                                  (0x3U << INTMUX_CR2_MUX24SEL_Pos)
#define    INTMUX_CR2_MUX24SEL                                      INTMUX_CR2_MUX24SEL_Msk

#define    INTMUX_CR2_MUX23SEL_Pos                                  (14U)
#define    INTMUX_CR2_MUX23SEL_Msk                                  (0x3U << INTMUX_CR2_MUX23SEL_Pos)
#define    INTMUX_CR2_MUX23SEL                                      INTMUX_CR2_MUX23SEL_Msk

#define    INTMUX_CR2_MUX22SEL_Pos                                  (12U)
#define    INTMUX_CR2_MUX22SEL_Msk                                  (0x3U << INTMUX_CR2_MUX22SEL_Pos)
#define    INTMUX_CR2_MUX22SEL                                      INTMUX_CR2_MUX22SEL_Msk

#define    INTMUX_CR2_MUX21SEL_Pos                                  (10U)
#define    INTMUX_CR2_MUX21SEL_Msk                                  (0x3U << INTMUX_CR2_MUX21SEL_Pos)
#define    INTMUX_CR2_MUX21SEL                                      INTMUX_CR2_MUX21SEL_Msk

#define    INTMUX_CR2_MUX20SEL_Pos                                  (8U)
#define    INTMUX_CR2_MUX20SEL_Msk                                  (0x3U << INTMUX_CR2_MUX20SEL_Pos)
#define    INTMUX_CR2_MUX20SEL                                      INTMUX_CR2_MUX20SEL_Msk

#define    INTMUX_CR2_MUX19SEL_Pos                                  (6U)
#define    INTMUX_CR2_MUX19SEL_Msk                                  (0x3U << INTMUX_CR2_MUX19SEL_Pos)
#define    INTMUX_CR2_MUX19SEL                                      INTMUX_CR2_MUX19SEL_Msk

#define    INTMUX_CR2_MUX18SEL_Pos                                  (4U)
#define    INTMUX_CR2_MUX18SEL_Msk                                  (0x3U << INTMUX_CR2_MUX18SEL_Pos)
#define    INTMUX_CR2_MUX18SEL                                      INTMUX_CR2_MUX18SEL_Msk

#define    INTMUX_CR2_MUX17SEL_Pos                                  (2U)
#define    INTMUX_CR2_MUX17SEL_Msk                                  (0x3U << INTMUX_CR2_MUX17SEL_Pos)
#define    INTMUX_CR2_MUX17SEL                                      INTMUX_CR2_MUX17SEL_Msk

#define    INTMUX_CR2_MUX16SEL_Pos                                  (0U)
#define    INTMUX_CR2_MUX16SEL_Msk                                  (0x3U << INTMUX_CR2_MUX16SEL_Pos)
#define    INTMUX_CR2_MUX16SEL                                      INTMUX_CR2_MUX16SEL_Msk

#define    INTMUX_CR1_MUX15SEL_Pos                                 (30U)
#define    INTMUX_CR1_MUX15SEL_Msk                                 (0x3U << INTMUX_CR1_MUX15SEL_Pos)
#define    INTMUX_CR1_MUX15SEL                                     INTMUX_CR1_MUX15SEL_Msk

#define    INTMUX_CR1_MUX14SEL_Pos                                 (28U)
#define    INTMUX_CR1_MUX14SEL_Msk                                 (0x3U << INTMUX_CR1_MUX14SEL_Pos)
#define    INTMUX_CR1_MUX14SEL                                     INTMUX_CR1_MUX14SEL_Msk

#define    INTMUX_CR1_MUX13SEL_Pos                                 (26U)
#define    INTMUX_CR1_MUX13SEL_Msk                                 (0x3U << INTMUX_CR1_MUX13SEL_Pos)
#define    INTMUX_CR1_MUX13SEL                                     INTMUX_CR1_MUX13SEL_Msk

#define    INTMUX_CR1_MUX12SEL_Pos                                 (24U)
#define    INTMUX_CR1_MUX12SEL_Msk                                 (0x3U << INTMUX_CR1_MUX12SEL_Pos)
#define    INTMUX_CR1_MUX12SEL                                     INTMUX_CR1_MUX12SEL_Msk

#define    INTMUX_CR1_MUX11SEL_Pos                                 (22U)
#define    INTMUX_CR1_MUX11SEL_Msk                                 (0x3U << INTMUX_CR1_MUX11SEL_Pos)
#define    INTMUX_CR1_MUX11SEL                                     INTMUX_CR1_MUX11SEL_Msk

