GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_intmux.h
#define    INTMUX_CR1_MUX10SEL_Pos                                 (20U)
#define    INTMUX_CR1_MUX10SEL_Msk                                 (0x3U << INTMUX_CR1_MUX10SEL_Pos)
#define    INTMUX_CR1_MUX10SEL                                     INTMUX_CR1_MUX10SEL_Msk

#define    INTMUX_CR1_MUX9SEL_Pos                                  (18U)
#define    INTMUX_CR1_MUX9SEL_Msk                                  (0x3U << INTMUX_CR1_MUX9SEL_Pos)
#define    INTMUX_CR1_MUX9SEL                                      INTMUX_CR1_MUX9SEL_Msk

#define    INTMUX_CR1_MUX8SEL_Pos                                  (16U)
#define    INTMUX_CR1_MUX8SEL_Msk                                  (0x3U << INTMUX_CR1_MUX8SEL_Pos)
#define    INTMUX_CR1_MUX8SEL                                      INTMUX_CR1_MUX8SEL_Msk

#define    INTMUX_CR1_MUX7SEL_Pos                                  (14U)
#define    INTMUX_CR1_MUX7SEL_Msk                                  (0x3U << INTMUX_CR1_MUX7SEL_Pos)
#define    INTMUX_CR1_MUX7SEL                                      INTMUX_CR1_MUX7SEL_Msk

#define    INTMUX_CR1_MUX6SEL_Pos                                  (12U)
#define    INTMUX_CR1_MUX6SEL_Msk                                  (0x3U << INTMUX_CR1_MUX6SEL_Pos)
#define    INTMUX_CR1_MUX6SEL                                      INTMUX_CR1_MUX6SEL_Msk

#define    INTMUX_CR1_MUX5SEL_Pos                                  (10U)
#define    INTMUX_CR1_MUX5SEL_Msk                                  (0x3U << INTMUX_CR1_MUX5SEL_Pos)
#define    INTMUX_CR1_MUX5SEL                                      INTMUX_CR1_MUX5SEL_Msk

#define    INTMUX_CR1_MUX4SEL_Pos                                  (8U)
#define    INTMUX_CR1_MUX4SEL_Msk                                  (0x3U << INTMUX_CR1_MUX4SEL_Pos)
#define    INTMUX_CR1_MUX4SEL                                      INTMUX_CR1_MUX4SEL_Msk

#define    INTMUX_CR1_MUX3SEL_Pos                                  (6U)
#define    INTMUX_CR1_MUX3SEL_Msk                                  (0x3U << INTMUX_CR1_MUX3SEL_Pos)
#define    INTMUX_CR1_MUX3SEL                                      INTMUX_CR1_MUX3SEL_Msk

#define    INTMUX_CR1_MUX2SEL_Pos                                  (4U)
#define    INTMUX_CR1_MUX2SEL_Msk                                  (0x3U << INTMUX_CR1_MUX2SEL_Pos)
#define    INTMUX_CR1_MUX2SEL                                      INTMUX_CR1_MUX2SEL_Msk

#define    INTMUX_CR1_MUX1SEL_Pos                                  (2U)
#define    INTMUX_CR1_MUX1SEL_Msk                                  (0x3U << INTMUX_CR1_MUX1SEL_Pos)
#define    INTMUX_CR1_MUX1SEL                                      INTMUX_CR1_MUX1SEL_Msk

#define    INTMUX_CR1_MUX0SEL_Pos                                  (0U)
#define    INTMUX_CR1_MUX0SEL_Msk                                  (0x3U << INTMUX_CR1_MUX0SEL_Pos)
#define    INTMUX_CR1_MUX0SEL                                      INTMUX_CR1_MUX0SEL_Msk


#define    FL_INTMUX_MUX31SEL_RAMP_FDET_FLSECC_CLM                (0x0U << INTMUX_CR2_MUX31SEL_Pos)
#define    FL_INTMUX_MUX31SEL_TAU12                               (0x1U << INTMUX_CR2_MUX31SEL_Pos)
#define    FL_INTMUX_MUX31SEL_TAU13                               (0x2U << INTMUX_CR2_MUX31SEL_Pos)
#define    FL_INTMUX_MUX31SEL_TAU17                               (0x3U << INTMUX_CR2_MUX31SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX30SEL_EXTI                                (0x0U << INTMUX_CR2_MUX30SEL_Pos)
#define    FL_INTMUX_MUX30SEL_TAU15                               (0x1U << INTMUX_CR2_MUX30SEL_Pos)
#define    FL_INTMUX_MUX30SEL_TAU17                               (0x2U << INTMUX_CR2_MUX30SEL_Pos)
#define    FL_INTMUX_MUX30SEL_TAU05                               (0x3U << INTMUX_CR2_MUX30SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX29SEL_LPUART                              (0x0U << INTMUX_CR2_MUX29SEL_Pos)
#define    FL_INTMUX_MUX29SEL_TAU07                               (0x1U << INTMUX_CR2_MUX29SEL_Pos)
#define    FL_INTMUX_MUX29SEL_TAU10                               (0x2U << INTMUX_CR2_MUX29SEL_Pos)
#define    FL_INTMUX_MUX29SEL_TAU11                               (0x3U << INTMUX_CR2_MUX29SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX28SEL_ATIM                                (0x0U << INTMUX_CR2_MUX28SEL_Pos)
#define    FL_INTMUX_MUX28SEL_TAU14                               (0x1U << INTMUX_CR2_MUX28SEL_Pos)
#define    FL_INTMUX_MUX28SEL_TAU16                               (0x2U << INTMUX_CR2_MUX28SEL_Pos)
#define    FL_INTMUX_MUX28SEL_UART2                               (0x3U << INTMUX_CR2_MUX28SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX27SEL_NVMIF                               (0x0U << INTMUX_CR2_MUX27SEL_Pos)
#define    FL_INTMUX_MUX27SEL_TAU07                               (0x1U << INTMUX_CR2_MUX27SEL_Pos)
#define    FL_INTMUX_MUX27SEL_TAU10                               (0x2U << INTMUX_CR2_MUX27SEL_Pos)
#define    FL_INTMUX_MUX27SEL_TAU16                               (0x3U << INTMUX_CR2_MUX27SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX26SEL_SENTx                               (0x0U << INTMUX_CR2_MUX26SEL_Pos)
#define    FL_INTMUX_MUX26SEL_TAU03                               (0x1U << INTMUX_CR2_MUX26SEL_Pos)
#define    FL_INTMUX_MUX26SEL_TAU04                               (0x2U << INTMUX_CR2_MUX26SEL_Pos)
#define    FL_INTMUX_MUX26SEL_TAU15                               (0x3U << INTMUX_CR2_MUX26SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX25SEL_COMPx                               (0x0U << INTMUX_CR2_MUX25SEL_Pos)
#define    FL_INTMUX_MUX25SEL_TAU06                               (0x1U << INTMUX_CR2_MUX25SEL_Pos)
#define    FL_INTMUX_MUX25SEL_TAU07                               (0x2U << INTMUX_CR2_MUX25SEL_Pos)
#define    FL_INTMUX_MUX25SEL_TAU14                               (0x3U << INTMUX_CR2_MUX25SEL_Pos)
                                                                                    
                                                                                    
