GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_intmux.h
#define    FL_INTMUX_MUX24SEL_DAC                                 (0x0U << INTMUX_CR2_MUX24SEL_Pos)
#define    FL_INTMUX_MUX24SEL_TAU06                               (0x1U << INTMUX_CR2_MUX24SEL_Pos)
#define    FL_INTMUX_MUX24SEL_TAU07                               (0x2U << INTMUX_CR2_MUX24SEL_Pos)
#define    FL_INTMUX_MUX24SEL_TAU13                               (0x3U << INTMUX_CR2_MUX24SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX23SEL_TAUxx                               (0x0U << INTMUX_CR2_MUX23SEL_Pos)
#define    FL_INTMUX_MUX23SEL_UART0                               (0x1U << INTMUX_CR2_MUX23SEL_Pos)
#define    FL_INTMUX_MUX23SEL_UART2                               (0x2U << INTMUX_CR2_MUX23SEL_Pos)
#define    FL_INTMUX_MUX23SEL_UART4                               (0x3U << INTMUX_CR2_MUX23SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX22SEL_WKUPx                               (0x0U << INTMUX_CR2_MUX22SEL_Pos)
#define    FL_INTMUX_MUX22SEL_TAU15                               (0x1U << INTMUX_CR2_MUX22SEL_Pos)
#define    FL_INTMUX_MUX22SEL_TAU16                               (0x2U << INTMUX_CR2_MUX22SEL_Pos)
#define    FL_INTMUX_MUX22SEL_TAU12                               (0x3U << INTMUX_CR2_MUX22SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX21SEL_DMA                                 (0x0U << INTMUX_CR2_MUX21SEL_Pos)
#define    FL_INTMUX_MUX21SEL_TAU12                               (0x1U << INTMUX_CR2_MUX21SEL_Pos)
#define    FL_INTMUX_MUX21SEL_TAU13                               (0x2U << INTMUX_CR2_MUX21SEL_Pos)
#define    FL_INTMUX_MUX21SEL_TAU11                               (0x3U << INTMUX_CR2_MUX21SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX20SEL_LPTIM                               (0x0U << INTMUX_CR2_MUX20SEL_Pos)
#define    FL_INTMUX_MUX20SEL_TAU13                               (0x1U << INTMUX_CR2_MUX20SEL_Pos)
#define    FL_INTMUX_MUX20SEL_TAU12                               (0x2U << INTMUX_CR2_MUX20SEL_Pos)
#define    FL_INTMUX_MUX20SEL_TAU11                               (0x3U << INTMUX_CR2_MUX20SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX19SEL_TSI                                 (0x0U << INTMUX_CR2_MUX19SEL_Pos)
#define    FL_INTMUX_MUX19SEL_SPI2                                (0x1U << INTMUX_CR2_MUX19SEL_Pos)
#define    FL_INTMUX_MUX19SEL_TAU03                               (0x2U << INTMUX_CR2_MUX19SEL_Pos)
#define    FL_INTMUX_MUX19SEL_TAU00                               (0x3U << INTMUX_CR2_MUX19SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX18SEL_BSTIM                               (0x0U << INTMUX_CR2_MUX18SEL_Pos)
#define    FL_INTMUX_MUX18SEL_TAU10                               (0x1U << INTMUX_CR2_MUX18SEL_Pos)
#define    FL_INTMUX_MUX18SEL_TAU07                               (0x2U << INTMUX_CR2_MUX18SEL_Pos)
#define    FL_INTMUX_MUX18SEL_TAU06                               (0x3U << INTMUX_CR2_MUX18SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX17SEL_UART7                               (0x0U << INTMUX_CR2_MUX17SEL_Pos)
#define    FL_INTMUX_MUX17SEL_TAU10                               (0x1U << INTMUX_CR2_MUX17SEL_Pos)
#define    FL_INTMUX_MUX17SEL_TAU16                               (0x2U << INTMUX_CR2_MUX17SEL_Pos)
#define    FL_INTMUX_MUX17SEL_LPTIM                               (0x3U << INTMUX_CR2_MUX17SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX16SEL_UART6                               (0x0U << INTMUX_CR2_MUX16SEL_Pos)
#define    FL_INTMUX_MUX16SEL_TAU15                               (0x1U << INTMUX_CR2_MUX16SEL_Pos)
#define    FL_INTMUX_MUX16SEL_TAU16                               (0x2U << INTMUX_CR2_MUX16SEL_Pos)
#define    FL_INTMUX_MUX16SEL_TAU03                               (0x3U << INTMUX_CR2_MUX16SEL_Pos)


#define    FL_INTMUX_MUX15SEL_I2C1                                (0x0U << INTMUX_CR1_MUX15SEL_Pos)
#define    FL_INTMUX_MUX15SEL_TAU16                               (0x1U << INTMUX_CR1_MUX15SEL_Pos)
#define    FL_INTMUX_MUX15SEL_TAU17                               (0x2U << INTMUX_CR1_MUX15SEL_Pos)
#define    FL_INTMUX_MUX15SEL_TAU10                               (0x3U << INTMUX_CR1_MUX15SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX14SEL_SPI1                                (0x0U << INTMUX_CR1_MUX14SEL_Pos)
#define    FL_INTMUX_MUX14SEL_TAU16                               (0x1U << INTMUX_CR1_MUX14SEL_Pos)
#define    FL_INTMUX_MUX14SEL_TAU17                               (0x2U << INTMUX_CR1_MUX14SEL_Pos)
#define    FL_INTMUX_MUX14SEL_TAU07                               (0x3U << INTMUX_CR1_MUX14SEL_Pos)
                                                                                    
                                                                                    
