GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_intmux.h
#define    FL_INTMUX_MUX13SEL_SPI0                                (0x0U << INTMUX_CR1_MUX13SEL_Pos)
#define    FL_INTMUX_MUX13SEL_TAU13                               (0x1U << INTMUX_CR1_MUX13SEL_Pos)
#define    FL_INTMUX_MUX13SEL_TAU14                               (0x2U << INTMUX_CR1_MUX13SEL_Pos)
#define    FL_INTMUX_MUX13SEL_TAU06                               (0x3U << INTMUX_CR1_MUX13SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX12SEL_I2C0                                (0x0U << INTMUX_CR1_MUX12SEL_Pos)
#define    FL_INTMUX_MUX12SEL_TAU03                               (0x1U << INTMUX_CR1_MUX12SEL_Pos)
#define    FL_INTMUX_MUX12SEL_TAU04                               (0x2U << INTMUX_CR1_MUX12SEL_Pos)
#define    FL_INTMUX_MUX12SEL_TAU05                               (0x3U << INTMUX_CR1_MUX12SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX11SEL_UART5                               (0x0U << INTMUX_CR1_MUX11SEL_Pos)
#define    FL_INTMUX_MUX11SEL_TAU17                               (0x1U << INTMUX_CR1_MUX11SEL_Pos)
#define    FL_INTMUX_MUX11SEL_TAU02                               (0x2U << INTMUX_CR1_MUX11SEL_Pos)
#define    FL_INTMUX_MUX11SEL_TAU01                               (0x3U << INTMUX_CR1_MUX11SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX10SEL_UART4                               (0x0U << INTMUX_CR1_MUX10SEL_Pos)
#define    FL_INTMUX_MUX10SEL_TAU12                               (0x1U << INTMUX_CR1_MUX10SEL_Pos)
#define    FL_INTMUX_MUX10SEL_TAU13                               (0x2U << INTMUX_CR1_MUX10SEL_Pos)
#define    FL_INTMUX_MUX10SEL_SPI2                                (0x3U << INTMUX_CR1_MUX10SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX9SEL_UART3                                (0x0U << INTMUX_CR1_MUX9SEL_Pos)
#define    FL_INTMUX_MUX9SEL_TAU06                                (0x1U << INTMUX_CR1_MUX9SEL_Pos)
#define    FL_INTMUX_MUX9SEL_TAU07                                (0x2U << INTMUX_CR1_MUX9SEL_Pos)
#define    FL_INTMUX_MUX9SEL_TAU13                                (0x3U << INTMUX_CR1_MUX9SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX8SEL_UART2                                (0x0U << INTMUX_CR1_MUX8SEL_Pos)
#define    FL_INTMUX_MUX8SEL_ATIM                                 (0x1U << INTMUX_CR1_MUX8SEL_Pos)
#define    FL_INTMUX_MUX8SEL_I2C0                                 (0x2U << INTMUX_CR1_MUX8SEL_Pos)
#define    FL_INTMUX_MUX8SEL_QSPI                                 (0x3U << INTMUX_CR1_MUX8SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX7SEL_UART1                                (0x0U << INTMUX_CR1_MUX7SEL_Pos)
#define    FL_INTMUX_MUX7SEL_TAU07                                (0x1U << INTMUX_CR1_MUX7SEL_Pos)
#define    FL_INTMUX_MUX7SEL_TAU10                                (0x2U << INTMUX_CR1_MUX7SEL_Pos)
#define    FL_INTMUX_MUX7SEL_TAU16                                (0x3U << INTMUX_CR1_MUX7SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX6SEL_UART0                                (0x0U << INTMUX_CR1_MUX6SEL_Pos)
#define    FL_INTMUX_MUX6SEL_SENTx                                (0x1U << INTMUX_CR1_MUX6SEL_Pos)
#define    FL_INTMUX_MUX6SEL_LPTIM                                (0x2U << INTMUX_CR1_MUX6SEL_Pos)
#define    FL_INTMUX_MUX6SEL_I2C0                                 (0x3U << INTMUX_CR1_MUX6SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX5SEL_ADC                                  (0x0U << INTMUX_CR1_MUX5SEL_Pos)
#define    FL_INTMUX_MUX5SEL_TAU11                                (0x1U << INTMUX_CR1_MUX5SEL_Pos)
#define    FL_INTMUX_MUX5SEL_TAU10                                (0x2U << INTMUX_CR1_MUX5SEL_Pos)
#define    FL_INTMUX_MUX5SEL_TAU04                                (0x3U << INTMUX_CR1_MUX5SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX4SEL_QSPI                                 (0x0U << INTMUX_CR1_MUX4SEL_Pos)
#define    FL_INTMUX_MUX4SEL_TAU15                                (0x1U << INTMUX_CR1_MUX4SEL_Pos)
#define    FL_INTMUX_MUX4SEL_TAU16                                (0x2U << INTMUX_CR1_MUX4SEL_Pos)
#define    FL_INTMUX_MUX4SEL_TAU03                                (0x3U << INTMUX_CR1_MUX4SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX3SEL_CANFD                                (0x0U << INTMUX_CR1_MUX3SEL_Pos)
#define    FL_INTMUX_MUX3SEL_TAU13                                (0x1U << INTMUX_CR1_MUX3SEL_Pos)
#define    FL_INTMUX_MUX3SEL_TAU14                                (0x2U << INTMUX_CR1_MUX3SEL_Pos)
#define    FL_INTMUX_MUX3SEL_TAU02                                (0x3U << INTMUX_CR1_MUX3SEL_Pos)
                                                                                    
                                                                                    
