GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_intmux.h
#define    FL_INTMUX_MUX2SEL_RTC                                  (0x0U << INTMUX_CR1_MUX2SEL_Pos)
#define    FL_INTMUX_MUX2SEL_TAU02                                (0x1U << INTMUX_CR1_MUX2SEL_Pos)
#define    FL_INTMUX_MUX2SEL_TAU05                                (0x2U << INTMUX_CR1_MUX2SEL_Pos)
#define    FL_INTMUX_MUX2SEL_TAU01                                (0x3U << INTMUX_CR1_MUX2SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX1SEL_SVD                                  (0x0U << INTMUX_CR1_MUX1SEL_Pos)
#define    FL_INTMUX_MUX1SEL_TAU04                                (0x1U << INTMUX_CR1_MUX1SEL_Pos)
#define    FL_INTMUX_MUX1SEL_TAU02                                (0x2U << INTMUX_CR1_MUX1SEL_Pos)
#define    FL_INTMUX_MUX1SEL_TAU01                                (0x3U << INTMUX_CR1_MUX1SEL_Pos)
                                                                                    
                                                                                    
#define    FL_INTMUX_MUX0SEL_WDT                                  (0x0U << INTMUX_CR1_MUX0SEL_Pos)
#define    FL_INTMUX_MUX0SEL_TAU02                                (0x1U << INTMUX_CR1_MUX0SEL_Pos)
#define    FL_INTMUX_MUX0SEL_TAU05                                (0x2U << INTMUX_CR1_MUX0SEL_Pos)
#define    FL_INTMUX_MUX0SEL_TAU00                                (0x3U << INTMUX_CR1_MUX0SEL_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup INTMUX_FL_Exported_Functions INTMUX Exported Functions
  * @{
  */


/**
  * @brief    Set MUX31SEL
  * @rmtoll   CR    MUX31SEL    FL_INTMUX_SetMUX31SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX31SEL_RAMP_FDET_FLSECC_CLM  
  *           @arg @ref FL_INTMUX_MUX31SEL_TAU12                 
  *           @arg @ref FL_INTMUX_MUX31SEL_TAU13                 
  *           @arg @ref FL_INTMUX_MUX31SEL_TAU17                 
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX31SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX31SEL_Msk, intsel);
}

/**
  * @brief    Get MUX31SEL
  * @rmtoll   CR    MUX31SEL    FL_INTMUX_GetMUX31SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX31SEL_RAMP_FDET_FLSECC_CLM  
  *           @arg @ref FL_INTMUX_MUX31SEL_TAU12                 
  *           @arg @ref FL_INTMUX_MUX31SEL_TAU13                 
  *           @arg @ref FL_INTMUX_MUX31SEL_TAU17                 
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX31SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX31SEL_Msk));
}


/**
  * @brief    Set MUX30SEL
  * @rmtoll   CR    MUX30SEL    FL_INTMUX_SetMUX30SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX30SEL_EXTI 
  *           @arg @ref FL_INTMUX_MUX30SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX30SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX30SEL_TAU05
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX30SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX30SEL_Msk, intsel);
}

/**
  * @brief    Get MUX30SEL
  * @rmtoll   CR    MUX30SEL    FL_INTMUX_GetMUX30SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX30SEL_EXTI 
  *           @arg @ref FL_INTMUX_MUX30SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX30SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX30SEL_TAU05
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX30SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX30SEL_Msk));
}


/**
  * @brief    Set MUX29SEL
  * @rmtoll   CR    MUX29SEL    FL_INTMUX_SetMUX29SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX29SEL_LPUART
  *           @arg @ref FL_INTMUX_MUX29SEL_TAU07 
  *           @arg @ref FL_INTMUX_MUX29SEL_TAU10 
  *           @arg @ref FL_INTMUX_MUX29SEL_TAU11 
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX29SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX29SEL_Msk, intsel);
}

/**
  * @brief    Get MUX29SEL
  * @rmtoll   CR    MUX29SEL    FL_INTMUX_GetMUX29SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX29SEL_LPUART
  *           @arg @ref FL_INTMUX_MUX29SEL_TAU07 
  *           @arg @ref FL_INTMUX_MUX29SEL_TAU10 
  *           @arg @ref FL_INTMUX_MUX29SEL_TAU11 
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX29SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX29SEL_Msk));
}


/**
  * @brief    Set MUX28SEL
  * @rmtoll   CR    MUX28SEL    FL_INTMUX_SetMUX28SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX28SEL_ATIM 
  *           @arg @ref FL_INTMUX_MUX28SEL_TAU14
  *           @arg @ref FL_INTMUX_MUX28SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX28SEL_UART2
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX28SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX28SEL_Msk, intsel);
}

/**
  * @brief    Get MUX28SEL
  * @rmtoll   CR    MUX28SEL    FL_INTMUX_GetMUX28SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX28SEL_ATIM 
  *           @arg @ref FL_INTMUX_MUX28SEL_TAU14
  *           @arg @ref FL_INTMUX_MUX28SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX28SEL_UART2
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX28SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX28SEL_Msk));
}


/**
  * @brief    Set MUX27SEL
  * @rmtoll   CR    MUX27SEL    FL_INTMUX_SetMUX27SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX27SEL_NVMIF
  *           @arg @ref FL_INTMUX_MUX27SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX27SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX27SEL_TAU16
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX27SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX27SEL_Msk, intsel);
}

/**
  * @brief    Get MUX27SEL
  * @rmtoll   CR    MUX27SEL    FL_INTMUX_GetMUX27SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX27SEL_NVMIF
  *           @arg @ref FL_INTMUX_MUX27SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX27SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX27SEL_TAU16
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX27SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX27SEL_Msk));
}


/**
  * @brief    Set MUX26SEL
  * @rmtoll   CR    MUX26SEL    FL_INTMUX_SetMUX26SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX26SEL_SENTx
  *           @arg @ref FL_INTMUX_MUX26SEL_TAU03
  *           @arg @ref FL_INTMUX_MUX26SEL_TAU04
  *           @arg @ref FL_INTMUX_MUX26SEL_TAU15
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX26SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX26SEL_Msk, intsel);
}

/**
  * @brief    Get MUX26SEL
  * @rmtoll   CR    MUX26SEL    FL_INTMUX_GetMUX26SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX26SEL_SENTx
  *           @arg @ref FL_INTMUX_MUX26SEL_TAU03
  *           @arg @ref FL_INTMUX_MUX26SEL_TAU04
  *           @arg @ref FL_INTMUX_MUX26SEL_TAU15
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX26SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX26SEL_Msk));
}


/**
  * @brief    Set MUX25SEL
  * @rmtoll   CR    MUX25SEL    FL_INTMUX_SetMUX25SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX25SEL_COMPx
  *           @arg @ref FL_INTMUX_MUX25SEL_TAU06
  *           @arg @ref FL_INTMUX_MUX25SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX25SEL_TAU14
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX25SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX25SEL_Msk, intsel);
}

/**
  * @brief    Get MUX25SEL
  * @rmtoll   CR    MUX25SEL    FL_INTMUX_GetMUX25SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX25SEL_COMPx
  *           @arg @ref FL_INTMUX_MUX25SEL_TAU06
  *           @arg @ref FL_INTMUX_MUX25SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX25SEL_TAU14
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX25SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX25SEL_Msk));
}


/**
  * @brief    Set MUX24SEL
  * @rmtoll   CR    MUX24SEL    FL_INTMUX_SetMUX24SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX24SEL_DAC  
  *           @arg @ref FL_INTMUX_MUX24SEL_TAU06
  *           @arg @ref FL_INTMUX_MUX24SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX24SEL_TAU13
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX24SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX24SEL_Msk, intsel);
}

/**
  * @brief    Get MUX24SEL
  * @rmtoll   CR    MUX24SEL    FL_INTMUX_GetMUX24SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX24SEL_DAC  
  *           @arg @ref FL_INTMUX_MUX24SEL_TAU06
  *           @arg @ref FL_INTMUX_MUX24SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX24SEL_TAU13
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX24SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX24SEL_Msk));
}


/**
  * @brief    Set MUX23SEL
  * @rmtoll   CR    MUX23SEL    FL_INTMUX_SetMUX23SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX23SEL_TAUxx
  *           @arg @ref FL_INTMUX_MUX23SEL_UART0
  *           @arg @ref FL_INTMUX_MUX23SEL_UART2
  *           @arg @ref FL_INTMUX_MUX23SEL_UART4
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX23SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX23SEL_Msk, intsel);
}

/**
  * @brief    Get MUX23SEL
  * @rmtoll   CR    MUX23SEL    FL_INTMUX_GetMUX23SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX23SEL_TAUxx
  *           @arg @ref FL_INTMUX_MUX23SEL_UART0
  *           @arg @ref FL_INTMUX_MUX23SEL_UART2
  *           @arg @ref FL_INTMUX_MUX23SEL_UART4
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX23SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX23SEL_Msk));
}


/**
  * @brief    Set MUX22SEL
  * @rmtoll   CR    MUX22SEL    FL_INTMUX_SetMUX22SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX22SEL_WKUPx
  *           @arg @ref FL_INTMUX_MUX22SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX22SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX22SEL_TAU12
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX22SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX22SEL_Msk, intsel);
}

/**
  * @brief    Get MUX22SEL
  * @rmtoll   CR    MUX22SEL    FL_INTMUX_GetMUX22SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX22SEL_WKUPx
  *           @arg @ref FL_INTMUX_MUX22SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX22SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX22SEL_TAU12
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX22SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX22SEL_Msk));
}


/**
  * @brief    Set MUX21SEL
  * @rmtoll   CR    MUX21SEL    FL_INTMUX_SetMUX21SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX21SEL_DMA  
  *           @arg @ref FL_INTMUX_MUX21SEL_TAU12
  *           @arg @ref FL_INTMUX_MUX21SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX21SEL_TAU11
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX21SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX21SEL_Msk, intsel);
}

/**
  * @brief    Get MUX21SEL
  * @rmtoll   CR    MUX21SEL    FL_INTMUX_GetMUX21SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX21SEL_DMA  
  *           @arg @ref FL_INTMUX_MUX21SEL_TAU12
  *           @arg @ref FL_INTMUX_MUX21SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX21SEL_TAU11
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX21SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX21SEL_Msk));
}


/**
  * @brief    Set MUX20SEL
  * @rmtoll   CR    MUX20SEL    FL_INTMUX_SetMUX20SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX20SEL_LPTIM
  *           @arg @ref FL_INTMUX_MUX20SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX20SEL_TAU12
  *           @arg @ref FL_INTMUX_MUX20SEL_TAU11
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX20SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX20SEL_Msk, intsel);
}

/**
  * @brief    Get MUX20SEL
  * @rmtoll   CR    MUX20SEL    FL_INTMUX_GetMUX20SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX20SEL_LPTIM
  *           @arg @ref FL_INTMUX_MUX20SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX20SEL_TAU12
  *           @arg @ref FL_INTMUX_MUX20SEL_TAU11
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX20SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX20SEL_Msk));
}


/**
  * @brief    Set MUX19SEL
  * @rmtoll   CR    MUX19SEL    FL_INTMUX_SetMUX19SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX19SEL_TSI  
  *           @arg @ref FL_INTMUX_MUX19SEL_SPI2 
  *           @arg @ref FL_INTMUX_MUX19SEL_TAU03
  *           @arg @ref FL_INTMUX_MUX19SEL_TAU00
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX19SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX19SEL_Msk, intsel);
}

/**
  * @brief    Get MUX19SEL
  * @rmtoll   CR    MUX19SEL    FL_INTMUX_GetMUX19SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX19SEL_TSI  
  *           @arg @ref FL_INTMUX_MUX19SEL_SPI2 
  *           @arg @ref FL_INTMUX_MUX19SEL_TAU03
  *           @arg @ref FL_INTMUX_MUX19SEL_TAU00
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX19SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX19SEL_Msk));
}


/**
  * @brief    Set MUX18SEL
  * @rmtoll   CR    MUX18SEL    FL_INTMUX_SetMUX18SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX18SEL_BSTIM
  *           @arg @ref FL_INTMUX_MUX18SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX18SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX18SEL_TAU06
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX18SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX18SEL_Msk, intsel);
}

/**
  * @brief    Get MUX18SEL
  * @rmtoll   CR    MUX18SEL    FL_INTMUX_GetMUX18SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX18SEL_BSTIM
  *           @arg @ref FL_INTMUX_MUX18SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX18SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX18SEL_TAU06
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX18SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX18SEL_Msk));
}


/**
  * @brief    Set MUX17SEL
  * @rmtoll   CR    MUX17SEL    FL_INTMUX_SetMUX17SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX17SEL_UART7
  *           @arg @ref FL_INTMUX_MUX17SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX17SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX17SEL_LPTIM
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX17SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX17SEL_Msk, intsel);
}

/**
  * @brief    Get MUX17SEL
  * @rmtoll   CR    MUX17SEL    FL_INTMUX_GetMUX17SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX17SEL_UART7
  *           @arg @ref FL_INTMUX_MUX17SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX17SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX17SEL_LPTIM
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX17SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX19SEL_Msk));
}


/**
  * @brief    Set MUX16SEL
  * @rmtoll   CR    MUX16SEL    FL_INTMUX_SetMUX16SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX16SEL_UART6
  *           @arg @ref FL_INTMUX_MUX16SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX16SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX16SEL_TAU03
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX16SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR2, INTMUX_CR2_MUX16SEL_Msk, intsel);
}

/**
  * @brief    Get MUX16SEL
  * @rmtoll   CR    MUX16SEL    FL_INTMUX_GetMUX16SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX16SEL_UART6
  *           @arg @ref FL_INTMUX_MUX16SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX16SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX16SEL_TAU03
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX16SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR2, INTMUX_CR2_MUX16SEL_Msk));
}


/**
  * @brief    Set MUX15SEL
  * @rmtoll   CR    MUX15SEL    FL_INTMUX_SetMUX15SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX15SEL_I2C1 
  *           @arg @ref FL_INTMUX_MUX15SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX15SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX15SEL_TAU10
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX15SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX15SEL_Msk, intsel);
}

/**
  * @brief    Get MUX15SEL
  * @rmtoll   CR    MUX15SEL    FL_INTMUX_GetMUX15SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX15SEL_I2C1 
  *           @arg @ref FL_INTMUX_MUX15SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX15SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX15SEL_TAU10
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX15SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX15SEL_Msk));
}


/**
  * @brief    Set MUX14SEL
  * @rmtoll   CR    MUX14SEL    FL_INTMUX_SetMUX14SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX14SEL_SPI1 
  *           @arg @ref FL_INTMUX_MUX14SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX14SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX14SEL_TAU07
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX14SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX14SEL_Msk, intsel);
}

/**
  * @brief    Get MUX14SEL
  * @rmtoll   CR    MUX14SEL    FL_INTMUX_GetMUX14SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX14SEL_SPI1 
  *           @arg @ref FL_INTMUX_MUX14SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX14SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX14SEL_TAU07
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX14SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX14SEL_Msk));
}


/**
  * @brief    Set MUX13SEL
  * @rmtoll   CR    MUX13SEL    FL_INTMUX_SetMUX13SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX13SEL_SPI0 
  *           @arg @ref FL_INTMUX_MUX13SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX13SEL_TAU14
  *           @arg @ref FL_INTMUX_MUX13SEL_TAU06
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX13SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX13SEL_Msk, intsel);
}

/**
  * @brief    Get MUX13SEL
  * @rmtoll   CR    MUX13SEL    FL_INTMUX_GetMUX13SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX13SEL_SPI0 
  *           @arg @ref FL_INTMUX_MUX13SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX13SEL_TAU14
  *           @arg @ref FL_INTMUX_MUX13SEL_TAU06
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX13SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX13SEL_Msk));
}


/**
  * @brief    Set MUX12SEL
  * @rmtoll   CR    MUX12SEL    FL_INTMUX_SetMUX12SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX12SEL_I2C0 
  *           @arg @ref FL_INTMUX_MUX12SEL_TAU03
  *           @arg @ref FL_INTMUX_MUX12SEL_TAU04
  *           @arg @ref FL_INTMUX_MUX12SEL_TAU05
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX12SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX12SEL_Msk, intsel);
}

/**
  * @brief    Get MUX12SEL
  * @rmtoll   CR    MUX12SEL    FL_INTMUX_GetMUX12SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX12SEL_I2C0 
  *           @arg @ref FL_INTMUX_MUX12SEL_TAU03
  *           @arg @ref FL_INTMUX_MUX12SEL_TAU04
  *           @arg @ref FL_INTMUX_MUX12SEL_TAU05
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX12SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX12SEL_Msk));
}


/**
  * @brief    Set MUX11SEL
  * @rmtoll   CR    MUX11SEL    FL_INTMUX_SetMUX11SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX11SEL_UART5
  *           @arg @ref FL_INTMUX_MUX11SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX11SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX11SEL_TAU01
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX11SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX11SEL_Msk, intsel);
}

/**
  * @brief    Get MUX11SEL
  * @rmtoll   CR    MUX11SEL    FL_INTMUX_GetMUX11SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX11SEL_UART5
  *           @arg @ref FL_INTMUX_MUX11SEL_TAU17
  *           @arg @ref FL_INTMUX_MUX11SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX11SEL_TAU01
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX11SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX11SEL_Msk));
}


/**
  * @brief    Set MUX10SEL
  * @rmtoll   CR    MUX10SEL    FL_INTMUX_SetMUX10SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX10SEL_UART4
  *           @arg @ref FL_INTMUX_MUX10SEL_TAU12
  *           @arg @ref FL_INTMUX_MUX10SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX10SEL_SPI2 
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX10SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX10SEL_Msk, intsel);
}

/**
  * @brief    Get MUX10SEL
  * @rmtoll   CR    MUX10SEL    FL_INTMUX_GetMUX10SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX10SEL_UART4
  *           @arg @ref FL_INTMUX_MUX10SEL_TAU12
  *           @arg @ref FL_INTMUX_MUX10SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX10SEL_SPI2 
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX10SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX10SEL_Msk));
}


