GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_intmux.h
/**
  * @brief    Set MUX9SEL
  * @rmtoll   CR    MUX9SEL    FL_INTMUX_SetMUX9SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX9SEL_UART3
  *           @arg @ref FL_INTMUX_MUX9SEL_TAU06
  *           @arg @ref FL_INTMUX_MUX9SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX9SEL_TAU13
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX9SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX9SEL_Msk, intsel);
}

/**
  * @brief    Get MUX9SEL
  * @rmtoll   CR    MUX9SEL    FL_INTMUX_GetMUX9SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX9SEL_UART3
  *           @arg @ref FL_INTMUX_MUX9SEL_TAU06
  *           @arg @ref FL_INTMUX_MUX9SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX9SEL_TAU13
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX9SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX9SEL_Msk));
}


/**
  * @brief    Set MUX8SEL
  * @rmtoll   CR    MUX8SEL    FL_INTMUX_SetMUX8SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX8SEL_UART2
  *           @arg @ref FL_INTMUX_MUX8SEL_ATIM 
  *           @arg @ref FL_INTMUX_MUX8SEL_I2C0 
  *           @arg @ref FL_INTMUX_MUX8SEL_QSPI 
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX8SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX8SEL_Msk, intsel);
}

/**
  * @brief    Get MUX8SEL
  * @rmtoll   CR    MUX8SEL    FL_INTMUX_GetMUX8SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX8SEL_UART2
  *           @arg @ref FL_INTMUX_MUX8SEL_ATIM 
  *           @arg @ref FL_INTMUX_MUX8SEL_I2C0 
  *           @arg @ref FL_INTMUX_MUX8SEL_QSPI 
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX8SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX8SEL_Msk));
}


/**
  * @brief    Set MUX7SEL
  * @rmtoll   CR    MUX7SEL    FL_INTMUX_SetMUX7SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX7SEL_UART1
  *           @arg @ref FL_INTMUX_MUX7SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX7SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX7SEL_TAU16
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX7SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX7SEL_Msk, intsel);
}

/**
  * @brief    Get MUX7SEL
  * @rmtoll   CR    MUX7SEL    FL_INTMUX_GetMUX7SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX7SEL_UART1
  *           @arg @ref FL_INTMUX_MUX7SEL_TAU07
  *           @arg @ref FL_INTMUX_MUX7SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX7SEL_TAU16
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX7SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX7SEL_Msk));
}


/**
  * @brief    Set MUX6SEL
  * @rmtoll   CR    MUX6SEL    FL_INTMUX_SetMUX6SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX6SEL_UART0
  *           @arg @ref FL_INTMUX_MUX6SEL_SENTx
  *           @arg @ref FL_INTMUX_MUX6SEL_LPTIM
  *           @arg @ref FL_INTMUX_MUX6SEL_I2C0 
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX6SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX6SEL_Msk, intsel);
}

/**
  * @brief    Get MUX6SEL
  * @rmtoll   CR    MUX6SEL    FL_INTMUX_GetMUX6SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX6SEL_UART0
  *           @arg @ref FL_INTMUX_MUX6SEL_SENTx
  *           @arg @ref FL_INTMUX_MUX6SEL_LPTIM
  *           @arg @ref FL_INTMUX_MUX6SEL_I2C0 
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX6SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX6SEL_Msk));
}


/**
  * @brief    Set MUX5SEL
  * @rmtoll   CR    MUX5SEL    FL_INTMUX_SetMUX5SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX5SEL_ADC  
  *           @arg @ref FL_INTMUX_MUX5SEL_TAU11
  *           @arg @ref FL_INTMUX_MUX5SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX5SEL_TAU04
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX5SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX5SEL_Msk, intsel);
}

/**
  * @brief    Get MUX5SEL
  * @rmtoll   CR    MUX5SEL    FL_INTMUX_GetMUX5SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX5SEL_ADC  
  *           @arg @ref FL_INTMUX_MUX5SEL_TAU11
  *           @arg @ref FL_INTMUX_MUX5SEL_TAU10
  *           @arg @ref FL_INTMUX_MUX5SEL_TAU04
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX5SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX5SEL_Msk));
}


/**
  * @brief    Set MUX4SEL
  * @rmtoll   CR    MUX4SEL    FL_INTMUX_SetMUX4SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX4SEL_QSPI 
  *           @arg @ref FL_INTMUX_MUX4SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX4SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX4SEL_TAU03
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX4SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX4SEL_Msk, intsel);
}

/**
  * @brief    Get MUX4SEL
  * @rmtoll   CR    MUX4SEL    FL_INTMUX_GetMUX4SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX4SEL_QSPI 
  *           @arg @ref FL_INTMUX_MUX4SEL_TAU15
  *           @arg @ref FL_INTMUX_MUX4SEL_TAU16
  *           @arg @ref FL_INTMUX_MUX4SEL_TAU03
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX4SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX4SEL_Msk));
}


/**
  * @brief    Set MUX3SEL
  * @rmtoll   CR    MUX3SEL    FL_INTMUX_SetMUX3SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX3SEL_CANFD
  *           @arg @ref FL_INTMUX_MUX3SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX3SEL_TAU14
  *           @arg @ref FL_INTMUX_MUX3SEL_TAU02
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX3SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX3SEL_Msk, intsel);
}

/**
  * @brief    Get MUX3SEL
  * @rmtoll   CR    MUX3SEL    FL_INTMUX_GetMUX3SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX3SEL_CANFD
  *           @arg @ref FL_INTMUX_MUX3SEL_TAU13
  *           @arg @ref FL_INTMUX_MUX3SEL_TAU14
  *           @arg @ref FL_INTMUX_MUX3SEL_TAU02
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX3SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX3SEL_Msk));
}


/**
  * @brief    Set MUX2SEL
  * @rmtoll   CR    MUX2SEL    FL_INTMUX_SetMUX2SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX2SEL_RTC  
  *           @arg @ref FL_INTMUX_MUX2SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX2SEL_TAU05
  *           @arg @ref FL_INTMUX_MUX2SEL_TAU01
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX2SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX2SEL_Msk, intsel);
}

/**
  * @brief    Get MUX2SEL
  * @rmtoll   CR    MUX2SEL    FL_INTMUX_GetMUX2SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX2SEL_RTC  
  *           @arg @ref FL_INTMUX_MUX2SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX2SEL_TAU05
  *           @arg @ref FL_INTMUX_MUX2SEL_TAU01
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX2SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX2SEL_Msk));
}


/**
  * @brief    Set MUX1SEL
  * @rmtoll   CR    MUX1SEL    FL_INTMUX_SetMUX1SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX1SEL_SVD  
  *           @arg @ref FL_INTMUX_MUX1SEL_TAU04
  *           @arg @ref FL_INTMUX_MUX1SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX1SEL_TAU01
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX1SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX1SEL_Msk, intsel);
}

/**
  * @brief    Get MUX1SEL
  * @rmtoll   CR    MUX1SEL    FL_INTMUX_GetMUX1SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX1SEL_SVD  
  *           @arg @ref FL_INTMUX_MUX1SEL_TAU04
  *           @arg @ref FL_INTMUX_MUX1SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX1SEL_TAU01
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX1SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX1SEL_Msk));
}


/**
  * @brief    Set MUX0SEL
  * @rmtoll   CR    MUX0SEL    FL_INTMUX_SetMUX0SEL
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX0SEL_WDT  
  *           @arg @ref FL_INTMUX_MUX0SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX0SEL_TAU05
  *           @arg @ref FL_INTMUX_MUX0SEL_TAU00
  * @retval   None
  */
__STATIC_INLINE void FL_INTMUX_SetMUX0SEL(uint32_t intsel)
{
    MODIFY_REG(INTMUX->CR1, INTMUX_CR1_MUX0SEL_Msk, intsel);
}

/**
  * @brief    Get MUX0SEL
  * @rmtoll   CR    MUX0SEL    FL_INTMUX_GetMUX0SEL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_INTMUX_MUX0SEL_WDT  
  *           @arg @ref FL_INTMUX_MUX0SEL_TAU02
  *           @arg @ref FL_INTMUX_MUX0SEL_TAU05
  *           @arg @ref FL_INTMUX_MUX0SEL_TAU00
  */
__STATIC_INLINE uint32_t FL_INTMUX_GetMUX0SEL(void)
{
    return (uint32_t)(READ_BIT(INTMUX->CR1, INTMUX_CR1_MUX0SEL_Msk));
}
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FH0XX_FL_INTMUX_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2024-01-04*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
